espressif/arduino-esp32/boards.txt
##############################################################


wipy3.name=WiPy 3.0

wipy3.upload.tool=esptool_py
wipy3.upload.maximum_size=1310720
wipy3.upload.maximum_data_size=294912
wipy3.upload.wait_for_upload_port=true

wipy3.serial.disableDTR=true
wipy3.serial.disableRTS=true

wipy3.build.mcu=esp32
wipy3.build.core=esp32
wipy3.build.variant=wipy3
wipy3.build.board=WIPY3

wipy3.build.f_cpu=240000000L
wipy3.build.flash_mode=dio
wipy3.build.flash_size=8MB
wipy3.build.boot=dio
wipy3.build.partitions=default
wipy3.build.defines=

wipy3.menu.FlashFreq.80=80MHz
wipy3.menu.FlashFreq.80.build.flash_freq=80m
wipy3.menu.FlashFreq.40=40MHz
wipy3.menu.FlashFreq.40.build.flash_freq=40m

wipy3.menu.UploadSpeed.921600=921600
wipy3.menu.UploadSpeed.921600.upload.speed=921600
wipy3.menu.UploadSpeed.115200=115200
wipy3.menu.UploadSpeed.115200.upload.speed=115200
wipy3.menu.UploadSpeed.256000.windows=256000
wipy3.menu.UploadSpeed.256000.upload.speed=256000
wipy3.menu.UploadSpeed.230400.windows.upload.speed=256000
wipy3.menu.UploadSpeed.230400=230400
wipy3.menu.UploadSpeed.230400.upload.speed=230400
wipy3.menu.UploadSpeed.460800.linux=460800
wipy3.menu.UploadSpeed.460800.macosx=460800
wipy3.menu.UploadSpeed.460800.upload.speed=460800
wipy3.menu.UploadSpeed.512000.windows=512000
wipy3.menu.UploadSpeed.512000.upload.speed=512000

wipy3.menu.DebugLevel.none=None
wipy3.menu.DebugLevel.none.build.code_debug=0
wipy3.menu.DebugLevel.error=Error
wipy3.menu.DebugLevel.error.build.code_debug=1
wipy3.menu.DebugLevel.warn=Warn
wipy3.menu.DebugLevel.warn.build.code_debug=2
wipy3.menu.DebugLevel.info=Info
wipy3.menu.DebugLevel.info.build.code_debug=3
wipy3.menu.DebugLevel.debug=Debug
wipy3.menu.DebugLevel.debug.build.code_debug=4
wipy3.menu.DebugLevel.verbose=Verbose
wipy3.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

bpi-bit.name=BPI-BIT

bpi-bit.upload.tool=esptool_py
bpi-bit.upload.maximum_size=1310720
bpi-bit.upload.maximum_data_size=294912
bpi-bit.upload.wait_for_upload_port=true

bpi-bit.serial.disableDTR=true
bpi-bit.serial.disableRTS=true

bpi-bit.build.mcu=esp32
bpi-bit.build.core=esp32
bpi-bit.build.variant=bpi-bit
bpi-bit.build.board=BPI-BIT

bpi-bit.build.f_cpu=160000000L
bpi-bit.build.flash_mode=dio
bpi-bit.build.flash_size=4MB
bpi-bit.build.boot=dio
bpi-bit.build.partitions=default

bpi-bit.menu.FlashFreq.80=80MHz
bpi-bit.menu.FlashFreq.80.build.flash_freq=80m
bpi-bit.menu.FlashFreq.40=40MHz
bpi-bit.menu.FlashFreq.40.build.flash_freq=40m

bpi-bit.menu.UploadSpeed.921600=921600
bpi-bit.menu.UploadSpeed.921600.upload.speed=921600
bpi-bit.menu.UploadSpeed.115200=115200
bpi-bit.menu.UploadSpeed.115200.upload.speed=115200
bpi-bit.menu.UploadSpeed.256000.windows=256000
bpi-bit.menu.UploadSpeed.256000.upload.speed=256000
bpi-bit.menu.UploadSpeed.230400.windows.upload.speed=256000
bpi-bit.menu.UploadSpeed.230400=230400
bpi-bit.menu.UploadSpeed.230400.upload.speed=230400
bpi-bit.menu.UploadSpeed.460800.linux=460800
bpi-bit.menu.UploadSpeed.460800.macosx=460800
bpi-bit.menu.UploadSpeed.460800.upload.speed=460800
bpi-bit.menu.UploadSpeed.512000.windows=512000
bpi-bit.menu.UploadSpeed.512000.upload.speed=512000

##############################################################

wesp32.name=Silicognition wESP32

wesp32.upload.tool=esptool_py
wesp32.upload.maximum_size=1310720
wesp32.upload.maximum_data_size=327680
wesp32.upload.wait_for_upload_port=true

wesp32.serial.disableDTR=true
wesp32.serial.disableRTS=true

wesp32.build.mcu=esp32
wesp32.build.core=esp32
wesp32.build.variant=wesp32
wesp32.build.board=WESP32

wesp32.build.f_cpu=240000000L
wesp32.build.flash_mode=dio
wesp32.build.flash_size=4MB
wesp32.build.boot=dio
wesp32.build.partitions=default
wesp32.build.defines=

wesp32.menu.FlashFreq.80=80MHz
wesp32.menu.FlashFreq.80.build.flash_freq=80m
wesp32.menu.FlashFreq.40=40MHz
wesp32.menu.FlashFreq.40.build.flash_freq=40m

wesp32.menu.UploadSpeed.921600=921600
wesp32.menu.UploadSpeed.921600.upload.speed=921600
wesp32.menu.UploadSpeed.115200=115200
wesp32.menu.UploadSpeed.115200.upload.speed=115200
wesp32.menu.UploadSpeed.256000.windows=256000
wesp32.menu.UploadSpeed.256000.upload.speed=256000
wesp32.menu.UploadSpeed.230400.windows.upload.speed=256000
wesp32.menu.UploadSpeed.230400=230400
wesp32.menu.UploadSpeed.230400.upload.speed=230400
wesp32.menu.UploadSpeed.460800.linux=460800
wesp32.menu.UploadSpeed.460800.macosx=460800
wesp32.menu.UploadSpeed.460800.upload.speed=460800
wesp32.menu.UploadSpeed.512000.windows=512000
wesp32.menu.UploadSpeed.512000.upload.speed=512000

wesp32.menu.DebugLevel.none=None
wesp32.menu.DebugLevel.none.build.code_debug=0
wesp32.menu.DebugLevel.error=Error
wesp32.menu.DebugLevel.error.build.code_debug=1
wesp32.menu.DebugLevel.warn=Warn
wesp32.menu.DebugLevel.warn.build.code_debug=2
wesp32.menu.DebugLevel.info=Info
wesp32.menu.DebugLevel.info.build.code_debug=3
wesp32.menu.DebugLevel.debug=Debug
wesp32.menu.DebugLevel.debug.build.code_debug=4
wesp32.menu.DebugLevel.verbose=Verbose
wesp32.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

t-beam.name=T-Beam

t-beam.upload.tool=esptool_py
t-beam.upload.maximum_size=1310720
t-beam.upload.maximum_data_size=327680
t-beam.upload.wait_for_upload_port=true

t-beam.serial.disableDTR=true
t-beam.serial.disableRTS=true

t-beam.build.mcu=esp32
t-beam.build.core=esp32
t-beam.build.variant=t-beam
t-beam.build.board=T-Beam

t-beam.build.f_cpu=240000000L
t-beam.build.flash_mode=dio
t-beam.build.flash_size=4MB
t-beam.build.boot=dio
t-beam.build.partitions=default

t-beam.menu.PSRAM.disabled=Disabled
t-beam.menu.PSRAM.disabled.build.defines=
t-beam.menu.PSRAM.enabled=Enabled
t-beam.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue

t-beam.menu.FlashFreq.80=80MHz
t-beam.menu.FlashFreq.80.build.flash_freq=80m
t-beam.menu.FlashFreq.40=40MHz
t-beam.menu.FlashFreq.40.build.flash_freq=40m

t-beam.menu.UploadSpeed.921600=921600
t-beam.menu.UploadSpeed.921600.upload.speed=921600
t-beam.menu.UploadSpeed.115200=115200
t-beam.menu.UploadSpeed.115200.upload.speed=115200
t-beam.menu.UploadSpeed.256000.windows=256000
t-beam.menu.UploadSpeed.256000.upload.speed=256000
t-beam.menu.UploadSpeed.230400.windows.upload.speed=256000
t-beam.menu.UploadSpeed.230400=230400
t-beam.menu.UploadSpeed.230400.upload.speed=230400
t-beam.menu.UploadSpeed.460800.linux=460800
t-beam.menu.UploadSpeed.460800.macosx=460800
t-beam.menu.UploadSpeed.460800.upload.speed=460800
t-beam.menu.UploadSpeed.512000.windows=512000
t-beam.menu.UploadSpeed.512000.upload.speed=512000

